{
  "_class_name": "SyncHuman_2D3DCrossSpaceDiffusion",
  "_diffusers_version": "0.29.1",
  "act_fn": "silu",
  "addition_channels": [
    1280,
    1280,
    1280
  ],
  "addition_downsample": false,
  "addition_embed_type": null,
  "addition_embed_type_num_heads": 64,
  "addition_time_embed_dim": null,
  "attention_head_dim": [
    5,
    10,
    20,
    20
  ],
  "block_out_channels": [
    320,
    640,
    1280,
    1280
  ],
  "cd_attention_last": false,
  "cd_attention_mid": false,
  "center_input_sample": false,
  "class_embed_type": "projection",
  "class_embeddings_concat": false,
  "cond_channels": 1024,
  "conv_in_kernel": 3,
  "conv_out_kernel": 3,
  "cross_attention_dim": 1024,
  "cross_attention_norm": null,
  "decay": 0.9999,
  "down_block_types": [
    "CrossAttnDownBlockMV2D",
    "CrossAttnDownBlockMV2D",
    "CrossAttnDownBlockMV2D",
    "DownBlock2D"
  ],
  "downsample_padding": 1,
  "dual_cross_attention": false,
  "encoder_hid_dim": null,
  "encoder_hid_dim_type": null,
  "flip_sin_to_cos": true,
  "freq_shift": 0,
  "in_channels": 8,
  "inv_gamma": 1.0,
  "layers_per_block": 2,
  "mid_block_only_cross_attention": null,
  "mid_block_scale_factor": 1,
  "mid_block_type": "UNetMidBlockMV2DCrossAttn",
  "min_decay": 0.0,
  "mlp_ratio": 4,
  "model_channels": 1024,
  "multiview_attention": true,
  "mv_cond_channels": 640,
  "mvcd_attention": true,
  "norm_eps": 1e-05,
  "norm_num_groups": 32,
  "num_attention_heads": null,
  "num_blocks": 24,
  "num_class_embeds": null,
  "num_dual_CrossAttblocks": 2,
  "num_head_channels": 64,
  "num_heads": 16,
  "num_views": 5,
  "only_cross_attention": false,
  "optimization_step": 42500,
  "out_channels": 4,
  "patch_size": 1,
  "pe_mode": "ape",
  "power": 0.6666666666666666,
  "projection_class_embeddings_input_dim": 2048,
  "qk_rms_norm": true,
  "qk_rms_norm_cross": false,
  "resnet_out_scale_factor": 1.0,
  "resnet_skip_time_act": false,
  "resnet_time_scale_shift": "default",
  "resolution": 16,
  "sample_size": 96,
  "selfattn_block": "self_rowwise",
  "share_mod": false,
  "sparse_mv_attention": true,
  "time_cond_proj_dim": null,
  "time_embedding_act_fn": null,
  "time_embedding_dim": null,
  "time_embedding_type": "positional",
  "timestep_post_act": null,
  "transformer_layers_per_block": 1,
  "trellis_in_channels": 8,
  "trellis_out_channels": 8,
  "up_block_types": [
    "UpBlock2D",
    "CrossAttnUpBlockMV2D",
    "CrossAttnUpBlockMV2D",
    "CrossAttnUpBlockMV2D"
  ],
  "upcast_attention": true,
  "update_after_step": 0,
  "use_checkpoint": false,
  "use_dino": false,
  "use_ema_warmup": false,
  "use_fp16": true,
  "use_linear_projection": true
}
